'''
Задача 1
Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.
'''
# print ("Задача_1")
# line = 0
# while line < 5:
#   line+=1
#  print(line,str('0000000'))


'''
Задача 2
Пользователь в цикле вводит 10 цифр. Найти количество введеных пользователем цифр 5.
'''
# print("Задача_2")
# n=0
# for i in range(1, 11, 1):
#   k = int(input('Введи число:'))
#   if k==5 : n += 1
# print("Колличество чисел пять равно:", n)

#Задача 3
#Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.

#print("Задача_3")
#sum=0
#for i in range (1,101,1):
#    sum +=i
#print (sum)


'''
Задача 4
Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.
'''
#print("Задача_4")

#y=1
#for i in range (1,11):
#    y*=i
#print('Произведение равно:',y)


'''
Задача 5
Вывести цифры числа на каждой строчке.
'''
#print("Задача_5")

#y=int(input('Введите число:'))
#while y>0 :
#    print(y%10)
#    y//=10


'''
Задача 6
Найти сумму цифр числа.
'''
#print("Задача_6")

#y=int(input('Введите число:'))
#sum=0
#while y>0:
#    sum=sum+y%10
#    y=y//10
    
#print (sum)
    

'''
Задача 7
Найти произведение цифр числа.
'''
#print("Задача_7")
#y=int(input('Введите число:'))
#mult=1
#while y>0:
#    mult=mult*(y%10)
#    y//=10
# print(mult)


'''
Задача 8
Дать ответ на вопрос: есть ли среди цифр числа 5?

'''
# print("Задача_8")
#
# integrate_number=1234
# while integrate_number>0:
#
#     if integrate_number%10 == 5:
#         print("Да")
#         break
#     integrate_number//=10
# else: print ("Нет")


'''
Задача 9
Найти максимальную цифру в числе
'''
# print("Задача_9")
# y=58396
# x=0
# while y>0:
#     if y%10 > x:
#         x = y%10
#     y//=10
# print (x)

'''
Задача 10
Найти количество цифр 5 в числе
'''
# print("Задача_9")
# y=5345675
# x=0
# while y>0:
#     if y%10 == 5:
#         x +=1
#     y//=10
# print (x)